tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4585_tdd.h
#define LATA1                         3881
#define LA1                           3882
#define LATA2                         3883
#define LA2                           3884
#define LATA3                         3885
#define LA3                           3886
#define LATA4                         3887
#define LA4                           3888
#define LATA5                         3889
#define LA5                           3890
#define LATA6                         3891
#define LA6                           3892
#define LATA7                         3893
#define LA7                           3894
#define LATB                          3895
#define LB0                           3896
#define LATB0                         3897
#define LB1                           3898
#define LATB1                         3899
#define LB2                           3900
#define LATB2                         3901
#define LB3                           3902
#define LATB3                         3903
#define LB4                           3904
#define LATB4                         3905
#define LB5                           3906
#define LATB5                         3907
#define LB6                           3908
#define LATB6                         3909
#define LB7                           3910
#define LATB7                         3911
#define LATC                          3912
#define LATC0                         3913
#define LC0                           3914
#define LATC1                         3915
#define LC1                           3916
#define LATC2                         3917
#define LC2                           3918
#define LATC3                         3919
#define LC3                           3920
#define LATC4                         3921
#define LC4                           3922
#define LATC5                         3923
#define LC5                           3924
#define LATC6                         3925
#define LC6                           3926
#define LATC7                         3927
#define LC7                           3928
#define LATD                          3929
#define LATD0                         3930
#define LD0                           3931
#define LATD1                         3932
#define LD1                           3933
#define LATD2                         3934
#define LD2                           3935
#define LATD3                         3936
#define LD3                           3937
#define LATD4                         3938
#define LD4                           3939
#define LATD5                         3940
#define LD5                           3941
#define LATD6                         3942
#define LD6                           3943
#define LATD7                         3944
#define LD7                           3945
#define LATE                          3946
#define LATE0                         3947
#define LE0                           3948
#define LATE1                         3949
#define LE1                           3950
#define LATE2                         3951
#define LE2                           3952
#define TRISA                         3953
#define TRISA0                        3954
#define TRISA_RA0                     3955
#define TRISA1                        3956
#define TRISA_RA1                     3957
#define TRISA2                        3958
#define TRISA_RA2                     3959
#define TRISA3                        3960
#define TRISA_RA3                     3961
#define TRISA_RA4                     3962
#define TRISA4                        3963
#define TRISA_RA5                     3964
#define TRISA5                        3965
#define TRISA_RA6                     3966
#define TRISA6                        3967
#define TRISA_RA7                     3968
#define TRISA7                        3969
#define TRISB                         3970
#define TRISB_RB0                     3971
#define TRISB0                        3972
#define TRISB_RB1                     3973
#define TRISB1                        3974
#define TRISB_RB2                     3975
#define TRISB2                        3976
#define TRISB_RB3                     3977
#define TRISB3                        3978
#define TRISB_RB4                     3979
#define TRISB4                        3980
#define TRISB_RB5                     3981
#define TRISB5                        3982
#define TRISB_RB6                     3983
#define TRISB6                        3984
#define TRISB_RB7                     3985
#define TRISB7                        3986
#define TRISC                         3987
#define TRISC0                        3988
#define TRISC_RC0                     3989
#define TRISC1                        3990
#define TRISC_RC1                     3991
#define TRISC2                        3992
#define TRISC_RC2                     3993
#define TRISC3                        3994
#define TRISC_RC3                     3995
#define TRISC4                        3996
#define TRISC_RC4                     3997
#define TRISC5                        3998
#define TRISC_RC5                     3999
#define TRISC6                        4000
#define TRISC_RC6                     4001
#define TRISC7                        4002
#define TRISC_RC7                     4003
#define TRISD                         4004
#define TRISD_RD0                     4005
#define TRISD0                        4006
#define TRISD_RD1                     4007
#define TRISD1                        4008
#define TRISD_RD2                     4009
#define TRISD2                        4010
#define TRISD_RD3                     4011
#define TRISD3                        4012
#define TRISD_RD4                     4013
#define TRISD4                        4014
#define TRISD_RD5                     4015
#define TRISD5                        4016
#define TRISD_RD6                     4017
#define TRISD6                        4018
#define TRISD_RD7                     4019
#define TRISD7                        4020
#define TRISE                         4021
#define TRISE_RE0                     4022
#define TRISE0                        4023
#define TRISE_RE1                     4024
#define TRISE1                        4025
#define TRISE_RE2                     4026
#define TRISE2                        4027
#define PSPMODE                       4028
#define IBOV                          4029
#define OBF                           4030
#define IBF                           4031
#define OSCTUNE                       4032
#define TUN0                          4033
#define TUN                           4034
#define TUN1                          4035
#define TUN2                          4036
#define TUN3                          4037
#define TUN4                          4038
#define PLLEN                         4039
#define INTSCR                        4040
#define INTSRC                        4041
#define PIE1                          4042
#define TMR1IE                        4043
#define TMR2IE                        4044
#define CCP1IE                        4045
#define SSPIE                         4046
#define PIE1_TX1IE                    4047
#define TXIE                          4048
#define RCIE                          4049
#define RC1IE                         4050
#define ADIE                          4051
#define PSPIE                         4052
#define PIR1                          4053
#define TMR1IF                        4054
#define TMR2IF                        4055
#define CCP1IF                        4056
#define SSPIF                         4057
#define TXIF                          4058
#define PIR1_TX1IF                    4059
#define RCIF                          4060
#define RC1IF                         4061
#define ADIF                          4062
#define PSPIF                         4063
#define IPR1                          4064
#define TMR1IP                        4065
#define TMR2IP                        4066
#define CCP1IP                        4067
#define SSPIP                         4068
#define TXBIP                         4069
#define TX1IP                         4070
#define TXIP                          4071
#define RCIP                          4072
#define RC1IP                         4073
#define ADIP                          4074
#define PSPIP                         4075
#define PIE2                          4076
#define ECCP1IE                       4077
#define TMR3IE                        4078
#define HLVDIE                        4079
#define LVDIE                         4080
#define BCLIE                         4081
#define EEIE                          4082
#define CMIE                          4083
#define OSCFIE                        4084
#define PIR2                          4085
#define ECCP1IF                       4086
#define TMR3IF                        4087
#define HLVDIF                        4088
#define LVDIF                         4089
#define BCLIF                         4090
#define EEIF                          4091
#define CMIF                          4092
#define OSCFIF                        4093
#define IPR2                          4094
#define ECCP1IP                       4095
#define TMR3IP                        4096
#define HLVDIP                        4097
#define LVDIP                         4098
#define BCLIP                         4099
#define EEIP                          4100
#define CMIP                          4101
#define OSCFIP                        4102
#define PIE3                          4103
#define FIFOMWIE                      4104
#define FIFOWMIE                      4105
#define PIE3_RXB0IE                   4106
#define RXBnIE                        4107
#define RXBNIE                        4108
#define PIE3_RXB1IE                   4109
#define PIE3_TXB0IE                   4110
#define PIE3_TXB1IE                   4111
#define TXBnIE                        4112
#define PIE3_TXB2IE                   4113
#define TXBNIE                        4114
#define ERRIE                         4115
#define WAKIE                         4116
#define IRXIE                         4117
#define PIR3                          4118
#define FIFOWMIF                      4119
#define RXB0IF                        4120
#define RXBnIF                        4121
#define RXBNIF                        4122
#define RXB1IF                        4123
#define TXB0IF                        4124
#define TXB1IF                        4125
#define TXB2IF                        4126
#define TXBNIF                        4127
#define TXBnIF                        4128
#define ERRIF                         4129
#define WAKIF                         4130
#define IRXIF                         4131
#define IPR3                          4132
#define RXB0IP                        4133
#define FIFOWMIP                      4134
#define RXB1IP                        4135
#define RXBNIP                        4136
#define RXBnIP                        4137
#define TXB0IP                        4138
#define TXB1IP                        4139
#define TXBNIP                        4140
#define TXBnIP                        4141
#define TXB2IP                        4142
#define ERRIP                         4143
#define WAKIP                         4144
#define IRXIP                         4145
#define EECON1                        4146
#define RD                            4147
#define WR                            4148
#define WREN                          4149
#define WRERR                         4150
#define FREE                          4151
#define CFGS                          4152
#define EEFS                          4153
#define EEPGD                         4154
#define RCSTA                         4155
#define RCD8                          4156
#define RX9D                          4157
#define OERR                          4158
#define FERR                          4159
#define ADDEN                         4160
#define ADEN                          4161
#define CREN                          4162
#define SRENA                         4163
#define SREN                          4164
#define RC9                           4165
#define RC8_9                         4166
#define RX9                           4167
#define SPEN                          4168
#define TXSTA                         4169
#define TXD8                          4170
#define TX9D1                         4171
#define TX9D                          4172
#define TRMT                          4173
#define TRMT1                         4174
#define BRGH1                         4175
#define BRGH                          4176
#define SENDB1                        4177
#define SENDB                         4178
#define SYNC                          4179
#define SYNC1                         4180
#define TXEN1                         4181
#define TXEN                          4182
#define TX91                          4183
#define TX8_9                         4184
#define TX9                           4185
#define CSRC1                         4186
#define CSRC                          4187
#define T3CON                         4188
#define TMR3ON                        4189
#define TMR3CS                        4190
#define nT3SYNC                       4191
#define T3NSYNC                       4192
#define NOT_T3SYNC                    4193
#define T3SYNC                        4194
#define SOSCEN3                       4195
#define T3CCP1                        4196
#define T3CKPS                        4197
#define T3CKPS0                       4198
#define T3CKPS1                       4199
#define T3ECCP1                       4200
#define T3CCP2                        4201
#define T3CON_RD16                    4202
#define RD163                         4203
#define T3RD16                        4204
#define CMCON                         4205
#define CM                            4206
#define CMEN0                         4207
#define CM0                           4208
#define CMEN1                         4209
#define CM1                           4210
#define CMEN2                         4211
#define CM2                           4212
#define CIS                           4213
#define C1INV                         4214
#define C2INV                         4215
#define C1OUT                         4216
#define C2OUT                         4217
#define CVRCON                        4218
#define CVR                           4219
#define CVR0                          4220
#define CVR1                          4221
#define CVR2                          4222
#define CVR3                          4223
#define CVRCON_CVREF                  4224
#define CVRSS                         4225
#define CVRR                          4226
#define CVROEN                        4227
#define CVROE                         4228
#define CVREN                         4229
#define ECCP1AS                       4230
#define PSSBD                         4231
#define PSSBD0                        4232
#define PSSBD1                        4233
#define PSSAC                         4234
#define PSSAC0                        4235
#define PSSAC1                        4236
#define ECCPAS0                       4237
#define ECCPAS                        4238
#define ECCPAS1                       4239
#define ECCPAS2                       4240
#define ECCPASE                       4241
#define ECCP1DEL                      4242
#define PDC0                          4243
#define PDC                           4244
#define PDC1                          4245
#define PDC2                          4246
#define PDC3                          4247
#define PDC4                          4248
#define PDC5                          4249
#define PDC6                          4250
#define PRSEN                         4251
#define BAUDCON                       4252
#define ABDEN                         4253
#define W4E                           4254
#define WUE                           4255
#define BRG16                         4256
#define TXCKP                         4257
#define SCKP                          4258
#define RXCKP                         4259
#define RXDTP                         4260
#define RCIDL                         4261
#define ABDOVF                        4262
#define ECCP1CON                      4263
#define ECCP1M                        4264
#define ECCP1M0                       4265
#define ECCP1M1                       4266
#define ECCP1M2                       4267
#define ECCP1M3                       4268
#define EDC1B                         4269
#define EDC1B0                        4270
#define EDC1B1                        4271
#define EPWM1M0                       4272
#define EPWM1M                        4273
#define EPWM1M1                       4274
#define CCP1CON                       4275
#define CCP1M0                        4276
#define CCP1M                         4277
#define CCP1M1                        4278
#define CCP1M2                        4279
#define CCP1M3                        4280
#define DC1B                          4281
#define DC1B0                         4282
#define DC1B1                         4283
#define ADCON2                        4284
#define ADCS0                         4285
#define ADCS                          4286
#define ADCS1                         4287
#define ADCS2                         4288
#define ACQT0                         4289
#define ACQT                          4290
#define ACQT1                         4291
#define ACQT2                         4292
#define ADFM                          4293
#define ADCON1                        4294
#define PCFG0                         4295
#define PCFG                          4296
#define PCFG1                         4297
#define PCFG2                         4298
#define CHSN3                         4299
#define PCFG3                         4300
#define VCFG                          4301
#define VCFG0                         4302
#define VCFG01                        4303
#define VCFG11                        4304
#define VCFG1                         4305
#define ADCON0                        4306
#define ADON                          4307
#define nDONE                         4308
#define GO_nDONE                      4309
#define NOT_DONE                      4310
#define GODONE                        4311
#define GO_DONE                       4312
#define DONE                          4313
#define GO_NOT_DONE                   4314
#define GO                            4315
#define CHS0                          4316
#define CHS                           4317
#define CHS1                          4318
#define CHS2                          4319
#define CHS3                          4320
#define SSPCON2                       4321
#define SEN                           4322
#define RSEN                          4323
#define PEN                           4324
#define RCEN                          4325
#define ACKEN                         4326
#define ACKDT                         4327
#define ACKSTAT                       4328
#define GCEN                          4329
#define SSPCON1                       4330
#define SSPM0                         4331
#define SSPM                          4332
#define SSPM1                         4333
#define SSPM2                         4334
#define SSPM3                         4335
#define CKP                           4336
#define SSPEN                         4337
#define SSPOV                         4338
#define WCOL                          4339
#define SSPSTAT                       4340
#define BF                            4341
#define UA                            4342
#define R_NOT_W                       4343
#define READ_WRITE                    4344
#define NOT_W                         4345
#define R_W                           4346
#define nW                            4347
#define RW                            4348
#define nWRITE                        4349
#define R                             4350
#define NOT_WRITE                     4351
#define R_nW                          4352
#define I2C_READ                      4353
#define START                         4354
#define S                             4355
#define I2C_START                     4356
#define STOP                          4357
#define I2C_STOP                      4358
#define P                             4359
#define NOT_A                         4360
#define DATA_ADDRESS                  4361
#define nA                            4362
#define D_A                           4363
#define D_nA                          4364
#define D                             4365
#define DA                            4366
#define D_NOT_A                       4367
#define NOT_ADDRESS                   4368
#define nADDRESS                      4369
#define I2C_DAT                       4370
#define CKE                           4371
#define SMP                           4372
#define T2CON                         4373
#define T2CKPS0                       4374
#define T2CKPS                        4375
#define T2CKPS1                       4376
#define TMR2ON                        4377
#define T2OUTPS0                      4378
#define T2OUTPS                       4379
#define TOUTPS0                       4380
#define TOUTPS                        4381
#define T2OUTPS1                      4382
#define TOUTPS1                       4383
#define T2OUTPS2                      4384
#define TOUTPS2                       4385
#define T2OUTPS3                      4386
#define TOUTPS3                       4387
#define PR2                           4388
#define WM0                           4389
#define WM1                           4390
#define WAIT0                         4391
#define WAIT1                         4392
#define EBDIS                         4393
#define T1CON                         4394
#define TMR1ON                        4395
#define TMR1CS                        4396
#define NOT_T1SYNC                    4397
#define T1SYNC                        4398
#define nT1SYNC                       4399
#define T1INSYNC                      4400
#define T1OSCEN                       4401
#define SOSCEN                        4402
#define T1CKPS0                       4403
#define T1CKPS                        4404
#define T1CKPS1                       4405
#define T1RUN                         4406
#define T1RD16                        4407
#define T1CON_RD16                    4408
#define RCON                          4409
#define BOR                           4410
#define NOT_BOR                       4411
#define nBOR                          4412
#define POR                           4413
#define nPOR                          4414
#define NOT_POR                       4415
#define PD                            4416
#define nPD                           4417
#define NOT_PD                        4418
#define NOT_TO                        4419
#define nTO                           4420
#define TO                            4421
#define nRI                           4422
#define NOT_RI                        4423
#define RI                            4424
#define SBOREN                        4425
#define IPEN                          4426
#define WDTCON                        4427
#define SWDTE                         4428
#define SWDTEN                        4429
#define HLVDCON                       4430
#define HLVDL                         4431
#define HLVDL0                        4432
#define LVV0                          4433
#define LVDL0                         4434
#define HLVDL1                        4435
#define LVDL1                         4436
#define LVV1                          4437
#define HLVDL2                        4438
